In [53]:
#Author Zack Edwards

#This program will read the file US_Baby_Names_right.csv into a pandas data structure and will

#Print the data structure info
#Delete the column 'Unnamed: 0' and 'Id'
#Determine if there are more gender "F" or "M"
#Print the top 5 in terms of number of occurrences per name
#Print the number of names in the dataset
#Print the standard deviation of name occurrence
#0Print the basic descriptive statistics on the dataset



import numpy as np
import pandas as pd

data = pd.read_csv('US_Baby_Names_right.csv')

print('This is the raw data frame info')
print(data.info()) #step 1

This is the raw data frame info
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
Unnamed: 0    1016395 non-null int64
Id            1016395 non-null int64
Name          1016395 non-null object
Year          1016395 non-null int64
Gender        1016395 non-null object
State         1016395 non-null object
Count         1016395 non-null int64
dtypes: int64(4), object(3)
memory usage: 54.3+ MB
None

In [49]:
data.drop(['Unnamed: 0'], axis = 1, inplace = True)
data.drop(['Id'], axis = 1, inplace = True)
print('This is the first 5 entries')
data.head() #step 2 remove 2 columns

This is the first 5 entries

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

In [54]:
print('This compares the amount of male vs female')
data['Gender'].value_counts() #step 3 compare M vs F

This compares the amount of male vs female

F    558846
M    457549
Name: Gender, dtype: int64

In [58]:
data = data.groupby('Name').sum()
del data['Year']
bycount = data.sort_values(by = 'Count', ascending = False )
print('This is the 5 most used names')
bycount.head() #step 4 the top 5 most used names

This is the 5 most used names

          Unnamed: 0          Id   Count
Name
Jacob     1665680788  1665681356  242874
Emma      1629481684  1629482250  214852
Michael   1687520717  1687521295  214405
Ethan     1660807908  1660808475  209277
Isabella  1630131220  1630131786  204798

In [57]:
data['Count'].max()

4167

In [59]:
print('This is the number of entries')
print(len(data.index)) #step 5 the number of entries

This is the number of entries
17632

In [60]:
print('This is the standard deviation of the data')
data['Count'].std() #Step 6 the standard deviation of name entries

This is the standard deviation of the data

11006.069467891111